huygithcm/code_tung/esp32_car/src/main.cpp
// ===================== Encoder ISR (quadrature) =====================
void IRAM_ATTR isrEncL() {
  // doc kenh B de biet chieu
  if (digitalRead(ENC_L_B)) encL++; else encL--;
}
void IRAM_ATTR isrEncR() {
  if (digitalRead(ENC_R_B)) encR++; else encR--;
}

// ===================== MUX 74HC4067 =====================
// Doc 1 kenh (0..15)
int readMuxChannel(int ch) {
  digitalWrite(MUX_S0, ch & 0x01);
  digitalWrite(MUX_S1, (ch >> 1) & 0x01);
  digitalWrite(MUX_S2, (ch >> 2) & 0x01);
  // S3 da noi GND (chi doc CH0..CH7) -> khong can dieu khien
  delayMicroseconds(60);          // cho MUX + ADC on dinh (giam crosstalk)
  analogRead(MUX_SIG);            // mau bo (xa dien tich kenh truoc)
  long sum = 0;
  for (int k = 0; k < 4; k++) sum += analogRead(MUX_SIG);  // trung binh 4 mau
  return (int)(sum / 4);
}

// Doc 8 mat line (CH0..CH7 = C1..C8, trai -> phai) vao lineRaw[]
void readLine() {
  for (int i = 0; i < 8; i++) lineRaw[i] = readMuxChannel(i);
}

// In gia tri 8 mat + dang nhi phan theo nguong
void printLine() {
  readLine();
  Serial.print("RAW: ");
  for (int i = 0; i < 8; i++) { Serial.printf("%4d ", lineRaw[i]); }
  Serial.print(" | LINE(den=1): ");
  for (int i = 0; i < 8; i++) {
    if (!SENSOR_OK[i]) { Serial.print("x"); continue; }   // mat bi mask
    int th = lineCalibrated ? lineThresh[i] : LINE_THRESHOLD;
    Serial.print(lineRaw[i] < th ? "1" : "0");   // den = gia tri thap = 1
  }
  Serial.println();
}

// ===================== Motor =====================
// chieu: +1 thuan, -1 nghich, 0 dung
// Bu vung chet: neu co lenh chay (dir!=0) ma PWM < nguong khoi dong -> nang len MOTOR_MIN_PWM
static inline int applyMinPwm(int dir, int spd) {
  if (dir != 0 && spd > 0 && spd < MOTOR_MIN_PWM) return MOTOR_MIN_PWM;
  return spd;
}
void setMotorA(int dir, int spd) {
  if (INVERT_A) dir = -dir;
  spd = applyMinPwm(dir, spd);
  digitalWrite(MA_IN1, dir > 0);
  digitalWrite(MA_IN2, dir < 0);
  ledcWrite(MA_CH, dir == 0 ? 0 : spd);
}
void setMotorB(int dir, int spd) {
  if (INVERT_B) dir = -dir;
  spd = applyMinPwm(dir, spd);
  digitalWrite(MB_IN3, dir > 0);
  digitalWrite(MB_IN4, dir < 0);
  ledcWrite(MB_CH, dir == 0 ? 0 : spd);
}
void stopMotors() { setMotorA(0, 0); setMotorB(0, 0); }

// Dieu khien motor theo van toc co dau (-255..255)
void driveA(int v) { v = constrain(v, -255, 255); setMotorA(v > 0 ? 1 : (v < 0 ? -1 : 0), abs(v)); }
void driveB(int v) { v = constrain(v, -255, 255); setMotorB(v > 0 ? 1 : (v < 0 ? -1 : 0), abs(v)); }

// ===================== MPU6050 (gyro Z) =====================
// Encoder bi truot banh khi quay -> goc sai. Gyro do truc tiep van toc goc,
// hop nhat 2 nguon (complementary) cho poseTheta chinh xac hon.
bool  mpuOK = false;              // tim thay MPU6050?
float gyroBiasZ = 0;              // troi tinh (LSB) - do khi xe dung yen
float GYRO_W = 0.98;              // trong so tin GYRO khi hop nhat (0=chi encoder, 1=chi gyro)
int   GYRO_SIGN = 1;              // dao dau neu module gan nguoc chieu
float gyroDelta = 0;              // goc gyro tich luy (rad), odometry se tieu thu
unsigned long lastGyroUs = 0;
const float GYRO_LSB_PER_DPS = 131.0f;   // thang do +-250 do/s

void mpuWrite(uint8_t reg, uint8_t val) {
  Wire.beginTransmission(MPU_ADDR); Wire.write(reg); Wire.write(val); Wire.endTransmission();
}
int16_t mpuGyroZraw() {
  Wire.beginTransmission(MPU_ADDR); Wire.write(0x47);        // GYRO_ZOUT_H
  if (Wire.endTransmission(false) != 0) return 0;
  if (Wire.requestFrom((uint8_t)MPU_ADDR, (uint8_t)2) != 2) return 0;
  return (int16_t)((Wire.read() << 8) | Wire.read());
}
// Do troi tinh gyro - XE PHAI DUNG YEN khi goi
void gyroCalibrate(int n = 500) {
  if (!mpuOK) { hubLog("[gyro] chua co MPU6050"); return; }
  double sum = 0;
  for (int i = 0; i < n; i++) { sum += mpuGyroZraw(); delay(2); }
  gyroBiasZ = (float)(sum / n);
  gyroDelta = 0; lastGyroUs = micros();
  hubLog("[gyro] bias Z = " + String(gyroBiasZ, 1) + " LSB (" +
         String(gyroBiasZ / GYRO_LSB_PER_DPS, 2) + " do/s)");
}
void mpuInit() {
  Wire.begin(MPU_SDA, MPU_SCL, 400000);
  Wire.beginTransmission(MPU_ADDR); Wire.write(0x75);        // WHO_AM_I
  uint8_t who = 0;
  if (Wire.endTransmission(false) == 0 && Wire.requestFrom((uint8_t)MPU_ADDR, (uint8_t)1) == 1)
    who = Wire.read();
  mpuOK = (who != 0x00 && who != 0xFF);
  if (!mpuOK) { Serial.printf(">> MPU6050 KHONG THAY (SDA=%d SCL=%d) - dung encoder don thuan\n", MPU_SDA, MPU_SCL); return; }
  mpuWrite(0x6B, 0x80); delay(100);        // reset
  mpuWrite(0x6B, 0x01); delay(10);         // wake, clock = gyro X (on dinh hon)
  mpuWrite(0x1A, 0x03);                    // DLPF ~44Hz (loc rung motor)
  mpuWrite(0x1B, 0x00);                    // gyro +-250 do/s
  delay(50);
  Serial.printf(">> MPU6050 OK (WHO_AM_I=0x%02X, SDA=%d SCL=%d)\n", who, MPU_SDA, MPU_SCL);
  lastGyroUs = micros();
}
// Quet bus I2C: liet ke dia chi tim thay. Neu thay MPU ma chua init -> init lai.
void i2cScan() {
  // --- Chan doan muc dien ap 2 chan bus (truoc khi quet) ---
  // Bus I2C ranh phai o muc CAO (nho tro treo). Neu doc duoc THAP = chan bi
  // noi xuong GND / thiet bi giu bus -> khong bao gio giao tiep duoc.
  Wire.end();
  pinMode(MPU_SDA, INPUT_PULLUP);
  pinMode(MPU_SCL, INPUT_PULLUP);
  delay(5);
  int sdaLv = digitalRead(MPU_SDA), sclLv = digitalRead(MPU_SCL);
  hubLog("[i2c] Muc bus khi ranh: SDA(32)=" + String(sdaLv ? "CAO" : "THAP <-- LOI") +
         "  SCL(33)=" + String(sclLv ? "CAO" : "THAP <-- LOI") + "  (dung: ca hai CAO)");
  if (!sclLv || !sdaLv)
    hubLog("[i2c] Chan bi ghim xuong GND. Neu SCL(33) THAP: GO HAN day GPIO33 -> MUX S3 (S3 chi noi GND)");
  Wire.begin(MPU_SDA, MPU_SCL, 100000);   // 100kHz cho on dinh khi quet
  delay(5);

  String found = "";
  int n = 0;
  for (uint8_t a = 1; a < 127; a++) {
    Wire.beginTransmission(a);
    if (Wire.endTransmission() == 0) { found += " 0x" + String(a, HEX); n++; }
    delay(2);
  }
  if (n == 0) {
    hubLog("[i2c] KHONG thay thiet bi nao. Kiem tra: SDA=32, SCL=33, VCC=3.3V, GND chung, AD0=GND");
    return;
  }
  hubLog("[i2c] Thay " + String(n) + " thiet bi:" + found + "   (MPU6050 = 0x68)");
  if (!mpuOK) { hubLog("[i2c] Thu khoi tao lai MPU6050..."); mpuInit(); if (mpuOK) gyroCalibrate(); }
}

// Doc va bao cao 8 mat line (test cam bien tu xa)
void reportLine() {
  readLine();
  String s = "[line] RAW:";
  for (int i = 0; i < 8; i++) s += " " + String(lineRaw[i]);
  s += " | den=1:";
  int cnt = 0;
  for (int i = 0; i < 8; i++) {
    if (!SENSOR_OK[i]) { s += "x"; continue; }
    int th = lineCalibrated ? lineThresh[i] : LINE_THRESHOLD;
    bool black = lineRaw[i] < th;
    s += black ? "1" : "0";
    if (black) cnt++;
  }
  s += " cnt=" + String(cnt) + (lineCalibrated ? " (da cali)" : " (CHUA cali)");
  // Sai so sau khi tru trim: 0 = line dung tam. Am = line lech trai, duong = lech phai.
  if (computeLineError()) s += "  err=" + String(lineError, 2) + " (trim=" + String(LINE_TRIM, 2) + ")";
  else                    s += "  MAT LINE";
  hubLog(s);
}

// Dat TAM LINE tu dong: de xe dung cho muon bam (line duoi vi tri chuan) roi goi ham nay.
// Sai so tho hien tai se thanh moc 0 => het be lech 1 ben.
void lineSetZero() {
  float save = LINE_TRIM;
  LINE_TRIM = 0;                     // do sai so THO (chua tru trim)
  if (!computeLineError()) {
    LINE_TRIM = save;
    hubLog("[linezero] KHONG thay line - dat xe len vach roi thu lai");
    return;
  }
  LINE_TRIM = lineError;             // lay chinh no lam tam
  hubLog("[linezero] Da dat tam line: trim=" + String(LINE_TRIM, 2) +
         " (truoc=" + String(save, 2) + "). Gio line o vi tri nay = err 0.");
}

// Toc do goc hien tai (do/s) tu gyro. 0 neu khong co MPU.
float gyroRateDps() {
  if (!mpuOK) return 0;
  return GYRO_SIGN * (mpuGyroZraw() - gyroBiasZ) / GYRO_LSB_PER_DPS;
}

