huygithcm/code_tung/esp32_car/src/main.cpp
// Lay mau gyro va cong don goc. Tu gioi han ~250Hz.
void updateGyro() {
  if (!mpuOK) return;
  unsigned long now = micros();
  float dt = (now - lastGyroUs) * 1e-6f;
  if (dt < 0.004f) return;                 // toi da ~250Hz
  lastGyroUs = now;
  if (dt > 0.2f) return;                   // nhip qua dai -> bo (tranh nhay goc)
  float dps = (mpuGyroZraw() - gyroBiasZ) / GYRO_LSB_PER_DPS;
  gyroDelta += GYRO_SIGN * dps * dt * PI / 180.0f;   // rad
}

// ===================== Odometry =====================
// Cap nhat toa do (x,y,theta): quang duong tu encoder, GOC hop nhat encoder + gyro.
void updateOdometry() {
  updateGyro();                                // lay mau gyro (tu gioi han nhip)
  long l = encL, r = encR;
  long dL = l - lastOdoL;
  long dR = r - lastOdoR;
  lastOdoL = l; lastOdoR = r;
  float dThetaGyro = gyroDelta; gyroDelta = 0;  // tieu thu goc gyro da cong don
  if (dL == 0 && dR == 0 && fabsf(dThetaGyro) < 1e-6f) return;

  float mmPerPulse = (PI * WHEEL_DIAMETER_MM) / ENCODER_PPR;
  float sL = dL * mmPerPulse;
  float sR = dR * mmPerPulse;
  float dS = (sL + sR) * 0.5f;                 // quang duong tam xe
  float dThetaEnc = (sR - sL) / WHEEL_BASE_MM; // goc theo encoder (sai khi truot banh)
  // Hop nhat: tin gyro nhieu hon (khong bi truot), encoder chong troi dai han
  float dTheta = mpuOK ? (GYRO_W * dThetaGyro + (1.0f - GYRO_W) * dThetaEnc) : dThetaEnc;

  // tich phan vi tri (dung huong giua doan de chinh xac hon)
  poseX += dS * cosf(poseTheta + dTheta * 0.5f);
  poseY += dS * sinf(poseTheta + dTheta * 0.5f);
  poseTheta += dTheta;
}

void resetOdometry() {
  encL = 0; encR = 0; lastOdoL = 0; lastOdoR = 0;
  poseX = poseY = poseTheta = 0;
  gyroDelta = 0; lastGyroUs = micros();   // bo goc gyro con ton dong
}

// In toa do hien tai
void printPose() {
  Serial.printf("[pose] x=%.1fmm  y=%.1fmm  theta=%.1f deg  (encL=%ld encR=%ld)\n",
                poseX, poseY, poseTheta * 180.0f / PI, encL, encR);
}

// ===================== Tinh sai so line =====================
// Tra ve TRUE neu thay line. Cap nhat lineError (am=line lech trai, duong=phai).
// Den = gia tri THAP -> mat thay line khi raw < nguong.
bool computeLineError() {
  readLine();
  // trong so vi tri C1..C8: -3.5 .. +3.5 (giua C4-C5 = 0)
  static const float W[8] = {-3.5,-2.5,-1.5,-0.5, 0.5, 1.5, 2.5, 3.5};
  float sum = 0; int cnt = 0;
  for (int i = 0; i < 8; i++) {
    if (!SENSOR_OK[i]) continue;                   // bo qua mat hong
    int th = lineCalibrated ? lineThresh[i] : LINE_THRESHOLD;
    if (lineRaw[i] < th) { sum += W[i]; cnt++; }   // mat thay vach den
  }
  lineCount = cnt;
  if (cnt == 0) { lineLost = true; return false; } // mat line
  lineLost = false;
  // Tru LINE_TRIM de dua TAM THAT ve 0. Can thiet vi C1 bi mask -> mang dung duoc
  // la C2..C8, tam hinh hoc cua no o +0.5 chu khong phai 0; cong them sai lech
  // co khi gan thanh cam bien. Khong tru -> xe luon be lech 1 ben.
  lineError = sum / cnt - LINE_TRIM;
  return true;
}

// ===================== Vong dieu khien bam line =====================
void lineFollowStep() {
  bool found = computeLineError();
  if (!found) {
    // Mat line: quay tai cho theo huong lech cuoi cung de tim lai
    int dir = (lastError >= 0) ? 1 : -1;
    driveA(-dir * baseSpeed); driveB(dir * baseSpeed);
    return;
  }
  // PID
  errIntegral += lineError;
  errIntegral = constrain(errIntegral, -50, 50);
  float d = lineError - lastError;
  float correction = Kp * lineError + Ki * errIntegral + Kd * d;
  lastError = lineError;

  int left  = baseSpeed - (int)correction;   // line lech phai (error>0) -> phai nhanh hon, xe re phai
  int right = baseSpeed + (int)correction;
  driveA(left); driveB(right);
}

// ===================== Re chuan bang PID =====================
// Quay tai cho mot goc tuong doi (deg). Duong = quay trai (CCW), am = phai.
// Dung poseTheta lam phan hoi, PID dieu khien toc do quay, co timeout.
void turnRelative(float deg) {
  float startTheta = poseTheta;
  float target = poseTheta + deg * PI / 180.0f;
  float tol = TURN_TOL_DEG * PI / 180.0f;
  float lastErr = 0;
  float maxOverDeg = 0;             // vot lo lon nhat (deg)
  float dirSign = (deg >= 0) ? 1.0f : -1.0f;
  int settle = 0;
  bool settled = false;
  unsigned long t0 = millis();

  // --- Bo nho ghi trace step-response (cho autotune) ---
  const int TRMAX = 500;
  static uint16_t trT[TRMAX];        // thoi gian (ms tu khi bat dau)
  static float    trA[TRMAX];        // goc da quay (deg, theo huong re)
  int trN = 0;

  while (millis() - t0 < 4000) {     // timeout 4s
    updateOdometry();
    float err = target - poseTheta;
    while (err >  PI) err -= 2 * PI;  // chuan hoa [-pi, pi]
    while (err < -PI) err += 2 * PI;

    // theo doi vot lo: tien do theo huong re vuot qua |deg|
    float progDeg = (poseTheta - startTheta) * 180.0f / PI * dirSign;
    float over = progDeg - fabs(deg);
    if (over > maxOverDeg) maxOverDeg = over;

    // ghi trace (goc tuyet doi theo huong re, de luon duong khi tien toi tgt)
    if (trN < TRMAX) { trT[trN] = (uint16_t)(millis() - t0); trA[trN] = progDeg; trN++; }

    if (fabs(err) < tol) {
      stopMotors();
      if (++settle > 8) { settled = true; break; }  // on dinh ~40ms
    } else {
      settle = 0;
      float errDeg = fabs(err) * 180.0f / PI;
      int sgn = INVERT_TURN ? -1 : 1;

      if (errDeg < TURN_FINE_DEG) {
        // --- VUNG TINH: chay XUNG NGAN roi nghi ---
        // Ma sat tinh doi PWM >= TURN_MIN (~200) moi quay duoc, nhung 200 lien tuc o
        // gan dich se VOT LO -> dao chieu -> LAC QUA LAC LAI toi het timeout.
        // Xung ngan + nghi cho dung han => nhich tung chut, khong lac.
        int dir = (err >= 0) ? 1 : -1;
        driveA(sgn * dir * TURN_MIN); driveB(-sgn * dir * TURN_MIN);
        delay(TURN_PULSE_MS);
        stopMotors();
        delay(TURN_PAUSE_MS);            // cho xe dung han roi moi do lai
        lastErr = err;
        continue;
      }

      // --- VUNG THO: PID lien tuc. Ham bang toc do goc gyro (chinh xac hon
      // dao ham sai so vi khong bi nhieu luong tu hoa encoder). ---
      float damp;
      if (mpuOK) damp = -KdT * (gyroRateDps() * PI / 180.0f) * 0.05f;  // theo toc do goc that
      else       damp =  KdT * (err - lastErr);                        // fallback: dao ham sai so
      int spd = (int)(KpT * err + damp);
      spd = constrain(spd, -TURN_MAX, TURN_MAX);   // chan toc do -> bot quan tinh/vot lo
      if (abs(spd) < TURN_MIN) spd = (spd >= 0) ? TURN_MIN : -TURN_MIN;
      driveA(sgn * spd); driveB(-sgn * spd);       // quay tai cho: 2 banh nguoc chieu
    }
    lastErr = err;
    delay(5);
  }
  stopMotors();
  float achievedDeg = (poseTheta - startTheta) * 180.0f / PI;
  float errDeg = deg - achievedDeg;
  unsigned long ms = millis() - t0;
  // Dong ket qua co cau truc cho script tu doc/hieu chuan (Serial + Log xe tren web):
  char res[160];
  snprintf(res, sizeof(res),
    "[turnres] tgt=%.1f dat=%.2f err=%.2f votlo=%.2f ms=%lu %s",
    deg, achievedDeg, errDeg, maxOverDeg, ms, settled ? "ON DINH" : "TIMEOUT");
  hubLog(res);

